"Amp Simulation" = "Vahvist. simulointi"; 
"Amps" = "Vahvistimet";
"Analog Basic" = "Analoginen perus"; 
"Analog Mono" = "Analoginen mono"; 
"Analog Pad" = "Analogipadi"; 
"Analog Swirl" = "Analoginen pyörre"; 
"Analog Sync" = "Analoginen synkronointi"; 
"Auto Wah" = "Autom. wah"; 
"Automatic Filter" = "Automaattisuodin"; 
"Bass" = "Basso"; 
"Bass Amp" = "Bassovahvistin"; 
"Bass Reduction" = "Basson vaimennus"; 
"Bitcrusher" = "Bittimurskain"; 
"Chorus" = "Chorus"; 
"Church Organ" = "Kirkkourut"; 
"Compressor" = "Kompressori"; 
"Digital Basic" = "Digitaalinen perus"; 
"Digital Mono" = "Digitaalinen mono"; 
"Digital Stepper" = "Digitaalinen askellin"; 
"Distortion" = "Särö"; 
"Drum Kits" = "Rumpusetit"; 
"Ducker" = "Vaimennin"; 
"Echo" = "Kaiku"; 
"Electric Clav" = "Sähköklavinetti"; 
"Electric Piano" = "Sähköpiano"; 
"Enhance Timing" = "Paranna ajoitusta"; 
"Enhance Tuning" = "Paranna viritystä"; 
"Visual EQ" = "Visuaalinen taajuuskorjain"; 
"Flanger" = "Flanger"; 
"Gate" = "Portti"; 
"Guitar" = "Kitara"; 
"Horns" = "Torvet"; 
"Hybrid Basic" = "Hybridi perus"; 
"Hybrid Morph" = "Hybridi morfaus"; 
"Limiter" = "Limitteri"; 
"Overdrive" = "Overdrive"; 
"Phaser" = "Vaiheistus"; 
"Piano" = "Piano"; 
"Reverb" = "Jälkikaiku"; 
"Sampler" = "Malli";
"Sound Effects" = "Äänitehosteet"; 
"Speech Enhancer" = "Puheen vahvistus"; 
"Stomp Boxes" = "Efektipedaalit";
"Strings" = "Jousisoittimet"; 
"Tonewheel Organ" = "Äänipyöräurut"; 
"Track Echo" = "Raidan kaiku"; 
"Track Reverb" = "Raidan jälkikaiku";
"Treble Reduction" = "Diskantin vaimennus"; 
"Tremolo" = "Tremolo"; 
"Tuned Percussion" = "Viritetty perkussio"; 
"Tuner" = "Viritin"; 
"Vocal Transformer" = "Äänen muunnin"; 
"Voice" = "Puheääni"; 
"Woodwind" = "Puupuhallin"; 
"GarageBand Synth" = "GarageBand-syntetisaattori";

